#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]

/* automatically generated by rust-bindgen 0.65.1 */

#[doc = " <summary>\n The operation completed without errors.\n </summary>"]
pub const charls_jpegls_errc_success: charls_jpegls_errc = 0;
#[doc = " <summary>\n This error is returned when one of the arguments is invalid and no specific reason is available.\n </summary>"]
pub const charls_jpegls_errc_invalid_argument: charls_jpegls_errc = 1;
#[doc = " <summary>\n This error is returned when the JPEG stream contains a parameter value that is not supported by this implementation.\n </summary>"]
pub const charls_jpegls_errc_parameter_value_not_supported: charls_jpegls_errc = 2;
#[doc = " <summary>\n The destination buffer is too small to hold all the output.\n </summary>"]
pub const charls_jpegls_errc_destination_buffer_too_small: charls_jpegls_errc = 3;
#[doc = " <summary>\n The source buffer is too small, more input data was expected.\n </summary>"]
pub const charls_jpegls_errc_source_buffer_too_small: charls_jpegls_errc = 4;
#[doc = " <summary>\n This error is returned when the encoded bit stream contains a general structural problem.\n </summary>"]
pub const charls_jpegls_errc_invalid_encoded_data: charls_jpegls_errc = 5;
#[doc = " <summary>\n Too much compressed data.The decoding process is ready but the input buffer still contains encoded data.\n </summary>"]

pub const charls_spiff_compression_type_jbig: charls_spiff_compression_type = 4;
#[doc = " <summary>\n ISO/IEC 10918-1 or ISO/IEC 10918-3, commonly known as JPEG.\n </summary>"]
pub const charls_spiff_compression_type_jpeg: charls_spiff_compression_type = 5;
#[doc = " <summary>\n ISO/IEC 14495-1 or ISO/IEC 14495-2, commonly known as JPEG-LS. (extension defined in ISO/IEC 14495-1).\n This is the only valid option for JPEG-LS encoded images.\n </summary>"]
pub const charls_spiff_compression_type_jpeg_ls: charls_spiff_compression_type = 6;
#[doc = " <summary>\n Defines the compression options that can be used in a SPIFF header v2, as defined in ISO/IEC 10918-3, F.2.1\n </summary>"]
pub type charls_spiff_compression_type = i32;
#[doc = " <summary>\n VRES and HRES are to be interpreted as aspect ratio.\n </summary>\n <remark>\n If vertical or horizontal resolutions are not known, use this option and set VRES and HRES\n both to 1 to indicate that pixels in the image should be assumed to be square.\n </remark>"]
pub const charls_spiff_resolution_units_aspect_ratio: charls_spiff_resolution_units = 0;
#[doc = " <summary>\n Units of dots/samples per inch\n </summary>"]
pub const charls_spiff_resolution_units_dots_per_inch: charls_spiff_resolution_units = 1;
#[doc = " <summary>\n Units of dots/samples per centimeter.\n </summary>"]
pub const charls_spiff_resolution_units_dots_per_centimeter: charls_spiff_resolution_units = 2;
#[doc = " <summary>\n Defines the resolution units for the VRES and HRES parameters, as defined in ISO/IEC 10918-3, F.2.1\n </summary>"]
pub type charls_spiff_resolution_units = i32;
#[doc = " <summary>\n Defines the information that can be stored in a SPIFF header as defined in ISO/IEC 10918-3, Annex F\n </summary>\n <remark>\n The type I.8 is an unsigned 8 bit integer, the type I.32 is an 32 bit unsigned integer in the file header itself.\n The type is indicated by the symbol “F.” are 4-byte parameters in “fixed point” notation.\n The 16 most significant bits are essentially the same as a parameter of type I.16 and indicate the integer\n part of this number.\n The 16 least significant bits are essentially the same as an I.16 parameter and contain an unsigned integer that,\n when divided by 65536, represents the fractional part of the fixed point number.\n </remark>"]
#[repr(C)]
pub struct charls_spiff_header {
    pub profile_id: charls_spiff_profile_id,
    pub component_count: i32,
    pub height: u32,
    pub width: u32,
    pub color_space: charls_spiff_color_space,
    pub bits_per_sample: i32,
    pub compression_type: charls_spiff_compression_type,
    pub resolution_units: charls_spiff_resolution_units,
    pub vertical_resolution: u32,
    pub horizontal_resolution: u32,
}
#[test]
fn bindgen_test_layout_charls_spiff_header() {
    const UNINIT: ::std::mem::MaybeUninit<charls_spiff_header> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<charls_spiff_header>(),
        40usize,
        concat!("Size of: ", stringify!(charls_spiff_header))
    );
    assert_eq!(
        ::std::mem::align_of::<charls_spiff_header>(),
        4usize,
        concat!("Alignment of ", stringify!(charls_spiff_header))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).profile_id) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_spiff_header),
        "::",
        stringify!(profile_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).component_count) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_spiff_header),
        "::",
        stringify!(component_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_spiff_header),
        "::",
        stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_spiff_header),
        "::",
        stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color_space) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_spiff_header),
        "::",
        stringify!(color_space)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bits_per_sample) as usize - ptr as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_spiff_header),
        "::",
        stringify!(bits_per_sample)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compression_type) as usize - ptr as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_spiff_header),
        "::",
        stringify!(compression_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resolution_units) as usize - ptr as usize },
        28usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_spiff_header),
        "::",
        stringify!(resolution_units)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vertical_resolution) as usize - ptr as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_spiff_header),
        "::",
        stringify!(vertical_resolution)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).horizontal_resolution) as usize - ptr as usize },
        36usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_spiff_header),
        "::",
        stringify!(horizontal_resolution)
        )
    );
}
#[doc = " <summary>\n Defines the information that can be stored in a JPEG-LS Frame marker segment that applies to all scans.\n </summary>\n <remark>\n The JPEG-LS also allow to store sub-sampling information in a JPEG-LS Frame marker segment.\n CharLS does not support JPEG-LS images that contain sub-sampled scans.\n </remark>"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct charls_frame_info {
    #[doc = " <summary>\n Width of the image, range [1, 65535].\n </summary>"]
    pub width: u32,
    #[doc = " <summary>\n Height of the image, range [1, 65535].\n </summary>"]
    pub height: u32,
    #[doc = " <summary>\n Number of bits per sample, range [2, 16]\n </summary>"]
    pub bits_per_sample: i32,
    #[doc = " <summary>\n Number of components contained in the frame, range [1, 255]\n </summary>"]
    pub component_count: i32,
}
#[test]
fn bindgen_test_layout_charls_frame_info() {
    const UNINIT: ::std::mem::MaybeUninit<charls_frame_info> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<charls_frame_info>(),
        16usize,
        concat!("Size of: ", stringify!(charls_frame_info))
    );
    assert_eq!(
        ::std::mem::align_of::<charls_frame_info>(),
        4usize,
        concat!("Alignment of ", stringify!(charls_frame_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_frame_info),
        "::",
        stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_frame_info),
        "::",
        stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bits_per_sample) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_frame_info),
        "::",
        stringify!(bits_per_sample)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).component_count) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_frame_info),
        "::",
        stringify!(component_count)
        )
    );
}
#[doc = " <summary>\n Defines the JPEG-LS preset coding parameters as defined in ISO/IEC 14495-1, C.2.4.1.1.\n JPEG-LS defines a default set of parameters, but custom parameters can be used.\n When used these parameters are written into the encoded bit stream as they are needed for the decoding process.\n </summary>"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct charls_jpegls_pc_parameters {
    #[doc = " <summary>\n Maximum possible value for any image sample in a scan.\n This must be greater than or equal to the actual maximum value for the components in a scan.\n </summary>"]
    pub maximum_sample_value: i32,
    #[doc = " <summary>\n First quantization threshold value for the local gradients.\n </summary>"]
    pub threshold1: i32,
    #[doc = " <summary>\n Second quantization threshold value for the local gradients.\n </summary>"]
    pub threshold2: i32,
    #[doc = " <summary>\n Third quantization threshold value for the local gradients.\n </summary>"]
    pub threshold3: i32,
    #[doc = " <summary>\n Value at which the counters A, B, and N are halved.\n </summary>"]
    pub reset_value: i32,
}
#[test]
fn bindgen_test_layout_charls_jpegls_pc_parameters() {
    const UNINIT: ::std::mem::MaybeUninit<charls_jpegls_pc_parameters> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<charls_jpegls_pc_parameters>(),
        20usize,
        concat!("Size of: ", stringify!(charls_jpegls_pc_parameters))
    );
    assert_eq!(
        ::std::mem::align_of::<charls_jpegls_pc_parameters>(),
        4usize,
        concat!("Alignment of ", stringify!(charls_jpegls_pc_parameters))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maximum_sample_value) as usize - ptr as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_jpegls_pc_parameters),
        "::",
        stringify!(maximum_sample_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).threshold1) as usize - ptr as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_jpegls_pc_parameters),
        "::",
        stringify!(threshold1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).threshold2) as usize - ptr as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_jpegls_pc_parameters),
        "::",
        stringify!(threshold2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).threshold3) as usize - ptr as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_jpegls_pc_parameters),
        "::",
        stringify!(threshold3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reset_value) as usize - ptr as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(charls_jpegls_pc_parameters),
        "::",
        stringify!(reset_value)
        )
    );
}
extern "C" {
    pub fn charls_get_error_message(
        error_value: charls_jpegls_errc,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct charls_jpegls_decoder {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " <summary>\n Creates a JPEG-LS decoder instance, when finished with the instance destroy it with the function\n charls_jpegls_decoder_destroy.\n </summary>\n <returns>A reference to a new created decoder instance, or a null pointer when the creation fails.</returns>"]
    pub fn charls_jpegls_decoder_create() -> *mut charls_jpegls_decoder;
}
extern "C" {
